{
  "_name_or_path": "datalab-to/layout_order_hr3",
  "architectures": [
    "SuryaLayoutModel"
  ],
  "decoder": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_window_size": 16,
    "aux_heads": 0,
    "bad_words_ids": null,
    "bbox_size": 1024,
    "begin_suppress_tokens": null,
    "block_types": [
      "attention"
    ],
    "bos_token_id": 1,
    "causal": true,
    "chunk_size_feed_forward": 0,
    "conv1d_width": 4,
    "cross_attention_hidden_size": null,
    "cross_attn_layers": [
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9
    ],
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "double_residual_flow": true,
    "dropout": 0.1,
    "early_stopping": false,
    "encoder_cross_attn_layers": [
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9
    ],
    "encoder_hidden_size": 1024,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": 1,
    "exponential_decay_length_penalty": null,
    "final_w_init_variance_scale": 0.2,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "global_attn_layers": [
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9
    ],
    "head_dim": 64,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 512,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "img_size_bucket": 100,
    "init_std": 0.02,
    "intermediate_size": 2048,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "label_count": 20,
    "layer_norm_eps": 1e-05,
    "length_penalty": 1.0,
    "logits_soft_cap": 30.0,
    "lru_width": 512,
    "max_length": 20,
    "max_pause_tokens": 0,
    "min_length": 0,
    "model_type": "surya_layout",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 8,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 10,
    "num_key_value_heads": 4,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": 0,
    "pause_token_count": 0,
    "pause_token_id": 2,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "rms_norm_eps": 1e-06,
    "rope_theta": 10000.0,
    "self_attn_layers": [
      0,
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9
    ],
    "sep_token_id": null,
    "skew_scaler": 512,
    "special_token_count": 3,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": false,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 1025,
    "w_init_variance_scale": 0.01
  },
  "decoder_end_token_id": 1,
  "decoder_start_token_id": 1,
  "encoder": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "attention_probs_dropout_prob": 0.0,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depths": [
      2,
      2,
      12,
      2
    ],
    "diversity_penalty": 0.0,
    "do_sample": false,
    "drop_path_rate": 0.1,
    "early_stopping": false,
    "embed_dim": 128,
    "encoder_length": 1024,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1024,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "image_size": [
      768,
      768
    ],
    "initializer_range": 0.02,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "mlp_ratio": 4.0,
    "model_type": "donut-swin",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_channels": 3,
    "num_heads": [
      4,
      8,
      16,
      32
    ],
    "num_kv_heads": [
      4,
      8,
      16,
      32
    ],
    "num_layers": 4,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 4,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "qkv_bias": true,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "typical_p": 1.0,
    "use_absolute_embeddings": false,
    "use_bfloat16": false,
    "use_positional_embeddings": true,
    "window_size": 8
  },
  "eos_token_id": 1,
  "is_encoder_decoder": true,
  "model_type": "vision-encoder-decoder",
  "pad_token_id": 0,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.47.1"
}
